In [102]:
import numpy as np
import pandas as pd

In [103]:
date = pd.read_csv('D:\MLworkspace\excelFiles\orders.csv')
time = pd.read_csv('D:\MLworkspace\excelFiles\messages.csv')

In [104]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [105]:
time.head() #chatting dataset

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [106]:
date.info() #by default date or time is in object(mns string hota hai), to convert that into date and time

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [107]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

Working with dates

In [109]:
#converting to datetime datatype
date['date'] = pd.to_datetime(date['date'])

In [110]:
date.info()

#note got converted into Dtype

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

1) Extract Year

In [84]:
date['date_year'] = date['date'].dt.year

In [85]:
date.head() #result will be in pandas series

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday,0
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday,0
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday,0
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday,1
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday,1

Extract Month

In [86]:
date['date_month_no'] = date['date'].dt.month

In [87]:
date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday,0
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday,0
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday,0
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday,1
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday,1

In [88]:
#if want month name then 'month_name()'
date['date_month_name'] = date['date'].dt.month_name()

In [89]:
date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday,0
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday,0
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday,0
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday,1
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday,1

2) Extract Days

In [90]:
date['date_day'] = date['date'].dt.day

In [91]:
date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday,0
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday,0
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday,0
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday,1
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday,1

In [92]:
#if want week ka konsa din hai to...
#day of week
date['date_dow'] = date['date'].dt.dayofweek

In [93]:
date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday,0
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday,0
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday,0
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday,1
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday,1

In [94]:
#day of week - name
date['date_dow_name'] = date['date'].dt.day_name()
date.drop(columns = ['product_id','city_id','orders']).head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend
0,2019-12-10,2019,12,December,10,1,Tuesday,0
1,2018-08-15,2018,8,August,15,2,Wednesday,0
2,2018-10-23,2018,10,October,23,1,Tuesday,0
3,2019-08-17,2019,8,August,17,5,Saturday,1
4,2019-01-06,2019,1,January,6,6,Sunday,1

In [97]:
# is weekend or not

date['date_is_weekend'] = np.where(date['date_dow_name'].isin(['Sunday', 'Saturday']), 1,0)

date.drop(columns=['product_id','city_id','orders']).head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend
0,2019-12-10,2019,12,December,10,1,Tuesday,0
1,2018-08-15,2018,8,August,15,2,Wednesday,0
2,2018-10-23,2018,10,October,23,1,Tuesday,0
3,2019-08-17,2019,8,August,17,5,Saturday,1
4,2019-01-06,2019,1,January,6,6,Sunday,1

In [120]:
# Extract week of the year #updated method
date['date_week'] = date['date'].dt.isocalendar().week
date.drop(columns=['product_id','city_id','orders']).head()

        date  date_week
0 2019-12-10         50
1 2018-08-15         33
2 2018-10-23         43
3 2019-08-17         33
4 2019-01-06          1

Extract Quarter

In [121]:
date['quarter'] = date['date'].dt.quarter

date.drop(columns=['product_id','city_id','orders']).head()

        date  date_week  quarter
0 2019-12-10         50        4
1 2018-08-15         33        3
2 2018-10-23         43        4
3 2019-08-17         33        3
4 2019-01-06          1        1

In [122]:
date['semester'] = np.where(date['quarter'].isin([1,2]), 1, 2)
date.drop(columns=['product_id','city_id','orders']).head()

        date  date_week  quarter  semester
0 2019-12-10         50        4         2
1 2018-08-15         33        3         2
2 2018-10-23         43        4         2
3 2019-08-17         33        3         2
4 2019-01-06          1        1         1

Extract Time elapsed between dates

In [123]:
import datetime

today = datetime.datetime.today()

today

datetime.datetime(2023, 8, 18, 15, 23, 8, 633298)

In [124]:
today - date['date']

0     1347 days 15:23:08.633298
1     1829 days 15:23:08.633298
2     1760 days 15:23:08.633298
3     1462 days 15:23:08.633298
4     1685 days 15:23:08.633298
                 ...
995   1775 days 15:23:08.633298
996   1716 days 15:23:08.633298
997   1564 days 15:23:08.633298
998   1629 days 15:23:08.633298
999   1403 days 15:23:08.633298
Name: date, Length: 1000, dtype: timedelta64[ns]

In [125]:
(today - date['date']).dt.days

0      1347
1      1829
2      1760
3      1462
4      1685
       ...
995    1775
996    1716
997    1564
998    1629
999    1403
Name: date, Length: 1000, dtype: int64

In [126]:
# Months passed

np.round((today -date['date']) / np.timedelta64(1, 'M'),0)

0      43.0
1      59.0
2      57.0
3      47.0
4      54.0
       ...
995    57.0
996    55.0
997    50.0
998    53.0
999    45.0
Name: date, Length: 1000, dtype: float64

In [127]:
# Converting to datetime datatype
time['date'] = pd.to_datetime(time['date'])

In [128]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

Extract time part

In [130]:
time['time'] = time['date'].dt.time
time.head()

,date,msg,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23:11:00

Time Difference

In [131]:
today - time['date']

0     3533 days 14:33:08.633298
1     3397 days 15:43:08.633298
2     3883 days 15:02:08.633298
3     3185 days 14:52:08.633298
4     3582 days 16:12:08.633298
                 ...
995   4172 days 14:33:08.633298
996   3493 days 16:09:08.633298
997   3958 days 15:46:08.633298
998   4074 days 15:49:08.633298
999   3346 days 15:58:08.633298
Name: date, Length: 1000, dtype: timedelta64[ns]

In seconds

In [132]:
(today - time['date'])/np.timedelta64(1,'s')

0      3.053036e+08
1      2.935574e+08
2      3.355453e+08
3      2.752375e+08
4      3.095431e+08
           ...
995    3.605132e+08
996    3.018533e+08
997    3.420280e+08
998    3.520505e+08
999    2.891519e+08
Name: date, Length: 1000, dtype: float64

In Minutes

In [133]:

(today - time['date'])/np.timedelta64(1,'m')

0      5.088393e+06
1      4.892623e+06
2      5.592422e+06
3      4.587292e+06
4      5.159052e+06
           ...
995    6.008553e+06
996    5.030889e+06
997    5.700466e+06
998    5.867509e+06
999    4.819198e+06
Name: date, Length: 1000, dtype: float64

In hours

In [134]:
(today - time['date'])/np.timedelta64(1,'h')

0       84806.552398
1       81543.719065
2       93207.035731
3       76454.869065
4       85984.202398
           ...
995    100142.552398
996     83848.152398
997     95007.769065
998     97791.819065
999     80319.969065
Name: date, Length: 1000, dtype: float64